{"/about/":{"data":{"":"This website was created as a learning tool to enhance my understanding of the KIN 320 course material.\nWhy I Built This\nThis project is more than just a collection of notes. It’s an opportunity for me to:\nDeepen my understanding: By actively engaging with the course content through website creation, I aim to solidify my knowledge of exercise physiology principles. Practice explaining the material: Translating complex concepts into clear and concise website content will help me refine my understanding and ability to explain these principles to others. Mentally organize the material: Structuring and presenting the course information in a logical and organized manner on this website will help me develop a deeper understanding of the relationships between different concepts. What You’ll Find Here\nExpect to find resources including:\nLecture Notes \u0026 Summaries: My own interpretations and summaries of key concepts. External Resources: Links to relevant articles, videos, and online tools. Personal Reflections: My own insights and observations on the course material. Disclaimer\nThis website is an independent project and does not represent the official course website. I hope this website proves to be a valuable resource for my own learning journey and perhaps even provides some helpful insights for fellow classmates.\nReferences\nThis site was built using Hugo and Hextra Starter Template. Flowcharts were rendered with Mermaid, LaTeX was rendered with KaTeX, and diagrams were produced with Asymptote.\n- Adrien Babet "},"title":"About This Website"},"/feb11/":{"data":{"":"type I diabetes does not produce insulin, type II is insulin resistant.","adrenal-hormones#Adrenal Hormones":" Aldosterone Adreneal Cortex Adrenal Cortex retain Na+ in DCT Renin -\u003e angiotensin (RAS system) Cortisol increases gluconeogenesis suppresses immune function in high enough ammounts Epinephrine \u0026 Norepinephrine "},"title":"Feb11"},"/lab/lab2emg/":{"data":{"":"","#":"Electromyography Data Sheet Subject #1: 21 F\nForearm circumference: 23 cm Maximal force: 23, 23, 22 Relative force: 1, 1, 1 (maximal force/forearm circumference) Subject #2: 20 M\nForearm circumference: 30 cm Maximal absolute force: 52, 52, 49 Maximal relative force: ______ ______ ______ (maximal force/forearm circumference) Integrated EMG - record integrated signal\nForce (kg) Integrated EMG For MVIC Subject 1 Subject 2 Absolute/Relative Absolute/Relative 5 XX -0.28 0.107 10 XX 0.173 -0.102 15 XX 0.105 -0.314 20 XX 0.73003 0.032 Maximum Force and Fatigue\n50% of Max Absol Force * Time to Fatigue (sec; Delta T) Subject 1 43.7 s Subject 2 70.4 s Use maximal force from above "},"title":"Lab2emg"},"/lab/lab3/":{"data":{"":"this lab report is due in 2 weeks (week of feb 18th)"},"title":"Lab3"},"/notes/questions/":{"data":{"":" strength vs. work\nparallel vs. serial muscle fibers (low gear vs high gear?)\nMuscles don’t like to stretch?"},"title":"Questions"},"/notes/week1/":{"data":{"":" Lecture Notes Lab how do nodes of ranvier work?\nForce production Almost always, more force is proced by more cross-bridges\nType I: slow twitch less crossbridging\nType II: fast twitch more crossbridging\nIn general, IIx \u003e IIa \u003e I Strength can be substituted for work??\nForce Velociy Curve Length Tension Curve Pennation Angle What is serial vs parallel muscle fibers?\nHow does pennation angle adapt to exercise?\nWhy is there a difference between maximal force production fatigue vs. submaximal fatigue?\nFatigue Components central factors (spine and brain) sleep deprivation ATP production etc… Specificity of training Overload Principle Applying periiodic stress to the muscles (1-2x/week) 🔨 This content is still under construction "},"title":"Week1"},"/notes/week2/":{"data":{"":"all or non law: upon threshold AP will be proagated at maximal velocity and consistently, or not at all\nmaximal velocity is relative to environment (temp)\nIce Cubes get hand really cold and try to write\nMuscles doesn’t like to stretch, stretching mostly affects connective tissue\nMultiple Sclerosis (MS) — demylenation disease\nThe order of motor neuron recruitment is directly related to the neuron diameter\nPlyometrics technically under 200ms stretch-shorten cycle. Ideal box height is 12-15 inches\nif you stretch a rubber band quickly it will snap back more quickly\nWhy does more ground time prevent rapid response at 200ms?"},"title":"Week2"},"/notes/week4/":{"data":{"":"","three-energy-systems#Three Energy Systems":"metabolism is approx. 20-30% efficient (70-80% lost as heat)\nresting ATP stores last approx. 1-2 sec\nGlycolitic encompasses both anaerobic \u0026 aerobic glycolysis\naerobic can use carbohydrate or fat\nAnaerobic Aerobic glycolysis ✅ ✅ lipolysis ❌ ✅ anaerobic glycolysis (sometimes called “fast glycolysis”)\ncreatine kinase catalyzes phosphorylation\nglycolysis occurs in the sarcoplasm and produces pyruvate\nin anaerobic, pyruvate is converted to lactate in the sarcoplasm\nmake notes on krebs cycle\nultrasound can scan for muscle glycogen\nwhat is the difference between lactate and lactic acid?\nHow much of DOMS is physical damage vs. chemical imbalance?\nOxidative System: pyruvate is shuttled to the mitochondria and oxidezed in the Krebs cycle and electron transport chain\nSystem Max Power Capacity Time to Max Activation Phosphocreatine 1 ATP Glycolysis How many days does it take to “carbo-load”?"},"title":"Week 4 Notes"}}